/*
Условие:
    Напишете програма, която прочита скрито съобщение в поредица от символи.
    Те се получават по един на ред до получаване на командата "End".
    Думите се образуват от буквите в реда на четенето им.
    Символите, които не са латински букви трябва да бъдат игнорирани.
    Думите скрити в потока са разделени от тайна команда от три букви – "c", "o" и "n".
    При първото получаване на една от тези букви, тя се маркира като срещната,
    но не се запазва в думата. При всяко следващо нейно срещане се записва нормално в думата.
    След като са налични и трите символа от командата, се печата думата и интервал " ".
    Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.
Вход:
    От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".
Изход:
    На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал.
Примерен вход и изход:
    H
    n
    e
    l
    l
    o
    o
    c
    t
    c
    h
    o
    e
    r
    e
    n
    e
    End
    -> Hello there
        "H", "n", "e", "l", "l", "o", "o", "c", "t", "c", "h", "o", "e", "r", "e", "n", "e"
        са всички букви прочетени от конзолата. Първо се чете "H" и се прибавя към думата.
        След това се чете "n".
        То е част от командата и не се прибавя към думата тъй като се среща за първи път.
        След това се четат "e", "l", "l" от конзолата и се добавят към думата.
        Прочита се "o" и се отбелязва като срещната, но не се добавя към думата.
        След това се прочита "o" отново и се записва.
        Следва "c" и вече  са налични символите за тайната команда.
        Отпечатва се "Hello " и се следи за нова тайна команда.
        Прочита се "t" и се запазва в новата дума.
        След това "c" e част от новата команда и не се добавя.
        Прочита се  "h" и се добавя към думата. Следва "o", което e част от новата команда.
        Прочитат се "e", "r", "e" и се добавят към думата. Приема се  "n" и тайната команда е завършена.
        Печата се "there ". Прочита се "e" и се добавя към нова дума.
        Получава се командата "End" и програмата приключва.
    Крайният резултат е "Hello there " .
    %
    !
    c
    ^
    B
    `
    o
    %
    o
    o
    M
    )
    {
    n
    \
    A
    D
    End
    -> BooM
        "%", "!", "c", "^", "B", "`", "o", "%", "o", "o", "M", ")", "{", "n", "\", "A", "D"
        са прочетените символи. Пропускат се "%" и "!", защото не са част от латинската азбука.
        Прочита се "c" и се запаметява за тайната команда, без да се добавя към думата.
        Пропуска се "^". Следва "B" и се записва в думата. Пропуска се "`".
        След това "o" е част от тайната команда и не се добавя в думата.
        Пропуска се "%". Прочитат се "o", "o", "M" и се записват към думата една след друга.
        Пропускат се ")" и "{". Следва "n" и тайната команда е завършена. Печата се "BooM ".
        Пропуска се "\". След това се четат  "A", "D" и се запаметяват в нова дума.
        Чете се командата "End" и програмата приключва.
        Окончателният резултат е "BooM ".
    o
    S
    %
    o
    l
    ^
    v
    e
    c
    n
    &
    m
    e
    c
    o
    n
    End
    -> Solve me
        "o", "S", "%", "o", "l"^", "v", "e", "c", "n", "&", "m", "e", "c", "o" и "n"
        са прочетените символи. Прочита се "o" и се запаметява за тайната команда,
        без да се добавя към думата. Следва "S" и се записва в думата. Пропуска се "%".
        Прочитат се "o" и "l" и се добавят към думата. Пропуска се "^".
        Прочитат се "v" и "e" и се добавят. Прочитат се "c" и "n" и командата се завършва.
        Отпечатва се "Solve ". Пропуска се "&". Прочитат се "m" и "e" и се записват в новата дума.
        Прочитат се "c", "o" и "n" и командата е изпълнена. Отпечатва се "me ".
        Прочита се "End" и програмата приключва.
        Крайния резултат е "Solve me ".
*/
package SoftUni.MoreExercises.WhileLoop;

import java.util.Scanner;

import static java.lang.System.*;

public class StreamOfLetters {
    static Scanner scanner = new Scanner(in);

    public static void main(String[] args) {
        boolean nFound = false, oFound = false, cFound = false;
        String word = "";
        String sentence = "";
        
        String input = scanner.nextLine();
        while(!input.equals("End")) {
            char character = input.charAt(0);
            
            String specialCharacters = "!#$%&'()*+,./:;<=>?@[]^_`{|}0123456789";
            boolean isSpecChar = false;
            for (int i = 0; i < specialCharacters.length(); i++)
                if (character == specialCharacters.charAt(i)) {
                    isSpecChar = true;
                    break;
                }
            
            if (!isSpecChar) {
                if (character == 'n' && nFound || character == 'o' && oFound || character == 'c' && cFound)
                    word += character;
                else if (character == 'n')
                    nFound = true;
                else if (character == 'o')
                    oFound = true;
                else if (character == 'c')
                    cFound = true;
                else
                    word += character;
            }
            
            if (nFound && oFound && cFound) {
                sentence += word + " ";
                nFound = false;
                oFound = false;
                cFound = false;
                word = "";
            }
            
            input = scanner.nextLine();
        }
        
        out.println(sentence);
    }
}
